In [11]:
import pandas as pd

In [12]:
df = pd.read_csv("data_cleaning_sample.csv")

In [13]:
df.head()

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019

In [17]:
df["Age"].astype("int32")

0    25
1    25
2    30
3    25
4    22
5    28
6    25
7    25
8    25
Name: Age, dtype: int32

In [18]:
df["Age"] = df["Age"].fillna(df["Age"].median())

In [19]:
df

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie  25.0        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie  25.0        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
8  Charlie  25.0        Delhi      M    charlie@example  20-07-2021

In [20]:
df.describe()

             Age
count   9.000000
mean   25.555556
std     2.242271
min    22.000000
25%    25.000000
50%    25.000000
75%    25.000000
max    30.000000

In [21]:
df.isnull()

    Name    Age   City  Gender  Email  Join Date
0  False  False  False   False  False      False
1  False  False  False   False  False      False
2  False  False  False   False  False      False
3  False  False  False   False  False      False
4  False  False  False   False  False      False
5   True  False  False   False  False       True
6  False  False  False   False  False      False
7  False  False  False   False  False      False
8  False  False  False   False  False      False

In [22]:
df.isnull().sum()

Name         1
Age          0
City         0
Gender       0
Email        0
Join Date    1
dtype: int64

In [23]:
df.dropna()

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie  25.0        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie  25.0        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
8  Charlie  25.0        Delhi      M    charlie@example  20-07-2021

In [24]:
df.dropna(axis=1)

    Age         City Gender              Email
0  25.0     New York      F  alice@example.com
1  25.0        Delhi      M    charlie@example
2  30.0  Los Angeles      M    bob@example.com
3  25.0        Delhi      M    charlie@example
4  22.0       Mumbai      M  david@example.com
5  28.0        Delhi      F     eve@domain.com
6  25.0     New York      F  alice@example.com
7  25.0     New York      F  alice@example.com
8  25.0        Delhi      M    charlie@example